roboticist-blip/SensiNerveX_STM32/Core/Src/main.c
/**
 * @file    main.c
 * @brief   FedVibroSense — STM32F405 Federated Learning Vibration Client
 *
 * Application entry point and main control loop.
 *
 * Hardware:
 *   MCU:    STM32F405RGT6 @ 168 MHz, Cortex-M4F (WeAct Studio core board)
 *   Sensor: MPU-6050 on I2C1 (PB8=SCL, PB9=SDA)
 *   Debug:  UART2 (PA2=TX, PA3=RX) @ 115200 baud
 *   FL:     UART1 (PA9=TX, PA10=RX) @ 921600 baud
 *   SD:     SDIO 4-bit (PC8-11=D0-D3, PC12=CK, PD2=CMD) — see SDCard.h
 *   Label:  PC13 button (active low) cycles class: normal→imbalance→looseness
 *   Status: PA4/5/6 LEDs = class indicator, PA7 = training indicator
 *
 * Main loop architecture:
 *
 *   main() no longer hand-sequences each subsystem. It builds a table of
 *   AppModule_t entries in App_Init() (see AppModule.h) and the loop body
 *   is a single AppModule_TickAll() call. Registration order fixes the
 *   tick order, which mirrors the original hand-written sequence:
 *
 *     [100 Hz]  IMUSample     — MPU-6050 read → complementary filter → ring push
 *     [1 Hz]    FeatureWindow — feature vector build → NN inference →
 *                               SD log enqueue → FL sample submit
 *               FLClient      — FL FSM tick (no-op outside TRAINING/
 *                               UPLOADING/DOWNLOADING/ERROR) → SD round log
 *               DataLogger    — drains at most one queued SD row per tick
 *     [async]   UARTCommand   — label/FL/log commands from the debug UART
 *
 *   Adding a new subsystem (another sensor, a second storage backend, a
 *   wireless transport, ...) means writing one Init/Tick pair and one
 *   AppModule_Register() call in App_Init() — this loop body is done
 *   growing. See Config.h "SCALABILITY / MODULE FRAMEWORK".
 *
 *  UART label injection:
 *    Receive single byte: '0'=normal, '1'=imbalance, '2'=looseness, 'u'=upload,
 *    'l'=SD log stats, 'f'=force SD flush.
 *
 * =========================================================================
 * CUBEMX-GENERATED FILES (DO NOT EDIT MANUALLY):
 *   Core/Src/stm32f4xx_hal_msp.c    — MSP init callbacks
 *   Core/Src/stm32f4xx_it.c         — IRQ handlers
 *   Core/Src/system_stm32f4xx.c     — SystemClock_Config stub
 *   Core/Inc/stm32f4xx_hal_conf.h   — HAL module enables
 *   Core/Inc/stm32f4xx_it.h
 *   Core/Inc/main.h                 — HAL handle externs
 *   Drivers/STM32F4xx_HAL_Driver/   — HAL library (full)
 *   Drivers/CMSIS/                  — CMSIS core headers
 *
 * MANUALLY CREATED FILES:
 *   Core/Src/main.c                 — THIS FILE
 *   Core/Src/MPU6050.c
 *   Core/Src/ComplementaryFilter.c
 *   Core/Src/FeatureExtractor.c
 *   Core/Src/NeuralNetwork.c
 *   Core/Src/Serialization.c
 *   Core/Src/FederatedClient.c
 *   Core/Src/Utils.c
 *   Core/Src/AppModule.c            — module table (NEW)
 *   Core/Src/SDCard.c               — SDIO block driver (NEW)
 *   Core/Src/diskio.c               — FatFs disk I/O glue (NEW)
 *   Core/Src/DataLogger.c           — SD/FatFs logging service (NEW)
 *   Core/Inc/  (all headers above)
 *
 * THIRD-PARTY (add separately — see Core/Inc/ffconf.h header comment):
 *   ff.c / ff.h / ffunicode.c       — FatFs core engine
 *
 * @author  FedVibroSense / SensiNerveX Project
 * @version 1.1.0
 */

//#include "main.h"
#include "stm32f4xx_hal.h"

/* Custom module headers */
#include "Config.h"
#include "Utils.h"
#include "MPU6050.h"
#include "ComplementaryFilter.h"
#include "FeatureExtractor.h"
#include "NeuralNetwork.h"
#include "FederatedClient.h"
#include "Serialization.h"
#include "AppModule.h"
#include "DataLogger.h"

#include <stdio.h>
#include <string.h>


I2C_HandleTypeDef  hi2c1;     /**< MPU-6050 I2C bus */
UART_HandleTypeDef huart1;    /**< FL communication UART (921600 baud) */
UART_HandleTypeDef huart2;    /**< Debug UART (115200 baud) */
TIM_HandleTypeDef  htim2;     /**< Free-running microsecond timer (32-bit) */
TIM_HandleTypeDef  htim3;     /**< 100 Hz sampling timer (period interrupt) */

/** IMU driver handle */
static MPU6050_Handle_t   s_mpu;

/** Complementary filter state */
static CF_State_t         s_cf_state;

/** Feature extractor (ring buffer + window state) */
static FE_State_t         s_fe;

/**
 * Neural network handle.
 * SRAM2 placement keeps the large W1 array (32 KB) out of main SRAM1
 * to reduce banking conflicts.
 * Uncomment __attribute__((section(".sram2"))) if your linker script
 * defines a .sram2 region for 0x10000000 (64 KB CCM on F405).
 *
 * CCM (Core Coupled Memory, 0x10000000, 64 KB) on STM32F405:
 *   - Zero-wait-state access from Cortex-M4
 *   - Ideal for the hot neural network weight matrix W1
 *   - NOT accessible by DMA (fine here, no DMA used for NN)
 */
/* __attribute__((section(".ccmram"))) */
static NN_Handle_t        s_nn;

/** Federated learning client */
static FLC_Handle_t       s_flc;

/** Scaled IMU sample output */
static MPU6050_Data_t     s_imu_data;

/** Complementary filter output per sample */
static CF_Output_t        s_cf_out;

/** Feature vector (500 floats, ~2 KB on stack is too large — static) */
static float              s_feature_vec[FEATURE_VECTOR_SIZE];

/** Set by TIM3 ISR at 100 Hz — signals time to read IMU */
volatile uint8_t g_sample_flag = 0U;

/** UART single-byte label command received */
volatile uint8_t g_uart_rx_byte = 0U;
volatile uint8_t g_uart_rx_ready = 0U;

static uint8_t s_current_label = CLASS_NORMAL;

/*
 * Shared main-loop state, now file-scope so the AppModule tick wrappers
 * below can each own their slice of it without threading extra
 * parameters through AppModule_TickFn's no-argument signature.
 */
static uint32_t s_window_count      = 0UL; /* Number of complete 1-s windows */
static uint32_t s_imu_sample_count  = 0UL; /* Number of raw 100 Hz IMU samples taken */

/* Most recent model prediction, updated once per feature window (1 Hz)
 * in Mod_FeatureWindow_Tick. Mod_ImuSample_Tick (100 Hz) tags every raw
 * IMU row with this same value between window updates — see the
 * IMPORTANT note on DataLogger_LogRawIMU() in DataLogger.h for why this
 * is NOT a fresh per-sample prediction. */
static uint8_t s_latest_pred        = CLASS_NORMAL;
static uint32_t s_last_window_ms    = 0UL; /* Timestamp of last feature build */

static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);

