roboticist-blip/SensiNerveX_STM32/Core/Src/main.c
static void App_Init(void);
static void App_HandleUARTCommand(uint8_t cmd);
static void App_UpdateLEDs(uint8_t class_idx, uint8_t training);

/*
 * =========================================================================
 * SCALABILITY REFACTOR — AppModule_t WRAPPERS
 *
 * Each existing subsystem gets a thin, no-argument Tick() wrapper here so
 * it can be driven from the AppModule table (AppModule.h) instead of a
 * hand-written sequence in main(). Registration order (set in App_Init)
 * preserves the original loop ordering: IMU sampling first (timing
 * critical), then the 1 Hz feature/inference/FL-submit step, then the FL
 * FSM tick, then SD logging drain, then UART command handling last.
 *
 * Adding a new subsystem later means writing one such wrapper and one
 * AppModule_Register() call — main()'s loop body never changes again.
 * =========================================================================
 */
static void Mod_ImuSample_Tick(void);
static void Mod_FeatureWindow_Tick(void);
static void Mod_FLC_Tick(void);
static void Mod_UartCommand_Tick(void);

static const AppModule_t s_mod_imu     = { .name = "IMUSample",     .init = NULL, .tick = Mod_ImuSample_Tick };
static const AppModule_t s_mod_feature = { .name = "FeatureWindow", .init = NULL, .tick = Mod_FeatureWindow_Tick };
static const AppModule_t s_mod_flc     = { .name = "FLClient",      .init = NULL, .tick = Mod_FLC_Tick };
static const AppModule_t s_mod_uart    = { .name = "UARTCommand",   .init = NULL, .tick = Mod_UartCommand_Tick };


int main(void)
{
    /* === EARLY DEBUG: Toggle all LEDs to show main() was entered === */
    __HAL_RCC_GPIOD_CLK_ENABLE();
    GPIO_InitTypeDef GPIO_Init = {0};
    GPIO_Init.Pin = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    GPIO_Init.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_Init.Pull = GPIO_NOPULL;
    GPIO_Init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_Init);
    
    /* Flash all LEDs to show main() started */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15, GPIO_PIN_SET);
    for (volatile int i = 0; i < 1000000; i++);  /* Busy wait ~1ms */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15, GPIO_PIN_RESET);
    
    /* --- 1. HAL initialization (sets SysTick at 1 kHz) ------------------ */
    HAL_Init();

    /* --- 2. Configure system clocks (168 MHz HSE PLL) ------------------- */
    SystemClock_Config();

    /* --- 3. Initialize peripherals -------------------------------------- */
    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_USART2_UART_Init();    /* Debug UART — init first for early logging */
    MX_USART1_UART_Init();    /* FL comm UART */
    MX_TIM2_Init();           /* Microsecond timer */
    MX_TIM3_Init();           /* 100 Hz sampling timer */

    /* --- 4. Application-level initialization ---------------------------- */
    App_Init();

    /* --- 5. Enable UART receive interrupt for label commands ------------ */
    HAL_UART_Receive_IT(&huart2, &g_uart_rx_byte, 1U);

    /* --- 6. Test GPIO and UART to diagnose connectivity ---- */
    /* Toggle LED PD12 to show the board is running */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_SET);   /* LED on */
    HAL_Delay(100);
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_RESET); /* LED off */
    HAL_Delay(100);
    
    /* Try to send test message with error checking */
    const char *test_msg = "\r\n[TEST] UART TEST MESSAGE\r\n";
    HAL_StatusTypeDef uart_status = HAL_UART_Transmit(&huart2, (uint8_t *)test_msg, 
                                                       strlen(test_msg), 500);
    /* If UART failed, try again once more */
    if (uart_status != HAL_OK) {
        HAL_Delay(50);
        HAL_UART_Transmit(&huart2, (uint8_t *)test_msg, strlen(test_msg), 500);
    }

    LOG_INF("=== FedVibroSense STM32F405 FL Client Started ===");
    LOG_INF("FEATURE_VECTOR_SIZE=%u, NN=%ux%ux%u, FL_LOCAL_EPOCHS=%u",
            FEATURE_VECTOR_SIZE, NN_INPUT_SIZE, NN_HIDDEN_SIZE, NN_OUTPUT_SIZE,
            FL_LOCAL_EPOCHS);
    Utils_PrintMemoryStats();

    /*
     * MAIN LOOP — now driven entirely by the AppModule table built in
     * App_Init(). Each iteration is one AppModule_TickAll() call, which
     * runs every registered module's Tick() in registration order:
     *
     *   [100 Hz]  IMUSample     — IMU read → CF update → ring push
     *   [1 Hz]    FeatureWindow — feature vector build → inference → FL submit
     *             FLClient      — FL FSM tick (only does work in non-idle states)
     *             DataLogger    — drains at most one queued SD row per call
     *   [async]   UARTCommand   — label/FL/log commands from the debug UART
     *
     * See AppModule.h for why this replaced the previous hand-written
     * sequence, and Config.h "SCALABILITY / MODULE FRAMEWORK" for how to
     * add a new subsystem without touching this loop again.
     */
    LOG_INF("App: %u modules registered, entering main loop", AppModule_Count());

    while (1) {
        AppModule_TickAll();
    }
    /* unreachable */
    return 0;
}

/*
 * =========================================================================
 * APPMODULE TICK IMPLEMENTATIONS
 *
 * Bodies are unchanged from the original inline main-loop code — only the
 * packaging changed (each became a standalone no-argument function so it
 * can sit in the AppModule table). See the wrapper declarations above
 * main() for the registration-order rationale.
 * =========================================================================
 */

/** [100 Hz] IMU read → CF update → ring push. Timing-critical: registered
 *  first so it always runs before the once-per-second work below it. */
static void Mod_ImuSample_Tick(void)
{
    if (!g_sample_flag) {
        return;
    }
    g_sample_flag = 0U;

    uint32_t t_start = Utils_GetMicros();

    /* Read IMU — if I2C fails, skip this sample */
    MPU6050_Status_t imu_ret = MPU6050_ReadScaled(&s_mpu, &s_imu_data);
    if (imu_ret != MPU6050_OK) {
        LOG_ERR("IMU read fail at window_cnt=%lu", s_window_count);
        return;
    }

    /* Update complementary filter */
    CF_Update(&s_cf_state, &s_imu_data, &s_cf_out);

    /* Push filter output to ring buffer */
    FE_Push(&s_fe, &s_cf_out);

    s_imu_sample_count++;

    /* Persist the raw 6-axis sensor reading to the IMU file — non-blocking,
     * queued (see DataLogger.h / DataLogger.c). This is the actual 100 Hz
     * ground truth: everything downstream (feature vectors, predictions)
     * is derived from this stream, so it's what validates the
     * complementary filter and feature extraction rather than just
     * re-describing their own output. t_start (already read above)
     * doubles as this sample's timestamp — one fewer timer read.
     * s_latest_pred is the most recent WINDOW prediction (1 Hz), not a
     * fresh per-sample one — see the note on DataLogger_LogRawIMU(). */
    DataLogger_LogRawIMU(s_imu_sample_count, t_start,
                         s_imu_data.ax, s_imu_data.ay, s_imu_data.az,
                         s_imu_data.gx, s_imu_data.gy, s_imu_data.gz,
                         s_current_label, s_latest_pred);

    uint32_t t_imu_us = Utils_ElapsedMicros(t_start);
    LOG_VRB("IMU+CF+Push: %lu µs | pitch=%.2f roll=%.2f",
            t_imu_us,
            (double)s_cf_out.pitch,
            (double)s_cf_out.roll);
}

/** [1 Hz] Feature vector build → inference → LED update → FL submit
 *  → SD log enqueue. */
static void Mod_FeatureWindow_Tick(void)
{
    uint32_t now_ms = Utils_GetMillis();
    if (!(FE_IsWindowReady(&s_fe) &&
          (now_ms - s_last_window_ms >= FEATURE_WINDOW_SECONDS * 1000U))) {
        return;
    }

    s_last_window_ms = now_ms;
    uint32_t t_feat = Utils_GetMicros();

