roboticist-blip/SensiNerveX_STM32/Core/Src/main.c
    /* Build 500-float normalized feature vector */
    uint8_t ok = FE_BuildFeatureVector(&s_fe, s_feature_vec);
    if (!ok) {
        LOG_ERR("Feature build failed");
        return;
    }
    uint32_t t_feat_us = Utils_ElapsedMicros(t_feat);

    /* Run inference on the new feature vector */
    uint32_t t_infer = Utils_GetMicros();
    NN_Forward(&s_nn, s_feature_vec);
    uint8_t pred = NN_Predict(&s_nn);
    uint32_t t_infer_us = Utils_ElapsedMicros(t_infer);

    /* Update the value Mod_ImuSample_Tick tags every raw IMU row with,
     * until the next window completes. */
    s_latest_pred = pred;

    s_window_count++;

    LOG_INF("Window #%lu | Pred=%u [N=%.3f I=%.3f L=%.3f] | "
            "feat=%lu µs infer=%lu µs",
            s_window_count, pred,
            (double)s_nn.a2[CLASS_NORMAL],
            (double)s_nn.a2[CLASS_IMBALANCE],
            (double)s_nn.a2[CLASS_LOOSENESS],
            t_feat_us, t_infer_us);

    /* Update LEDs with predicted class */
    App_UpdateLEDs(pred, 0U);

    /* Persist the compact operational summary to the LOG file —
     * non-blocking, queued, see DataLogger.h */
    DataLogger_LogWindow(s_window_count, now_ms,
                          s_cf_out.pitch, s_cf_out.roll, pred,
                          s_nn.a2[CLASS_NORMAL], s_nn.a2[CLASS_IMBALANCE],
                          s_nn.a2[CLASS_LOOSENESS], s_current_label);

    /* Persist the full raw feature vector + ground-truth label to the
     * DATA file for external retraining / publication reproducibility.
     * BLOCKING (once per window, i.e. 1 Hz here) — see the design note
     * above DataLogger_LogRawWindow() in DataLogger.c for why this one
     * isn't queued the way LogWindow() above is. */
    DataLogger_LogRawWindow(s_window_count, now_ms,
                             s_current_label, pred,
                             s_nn.a2[CLASS_NORMAL], s_nn.a2[CLASS_IMBALANCE],
                             s_nn.a2[CLASS_LOOSENESS],
                             s_feature_vec, FEATURE_VECTOR_SIZE);

    /* Submit to FL client if in labeled mode -------------------- */
    if (s_flc.state == FLC_STATE_IDLE ||
        s_flc.state == FLC_STATE_COLLECTING) {

        uint8_t submitted = FLC_SubmitSample(
            &s_flc, s_feature_vec, s_current_label);

        if (submitted) {
            LOG_INF("FL: submitted window #%lu with label=%u "
                    "(%u/%u buffered)",
                    s_window_count, s_current_label,
                    s_flc.train_buf.count, FL_LOCAL_EPOCHS);
        }
    }
}

/** Federated Learning FSM tick. Only does real work outside IDLE/COLLECTING;
 *  logs a round summary to SD whenever round_count advances. */
static void Mod_FLC_Tick(void)
{
    if (!(s_flc.state == FLC_STATE_TRAINING ||
          s_flc.state == FLC_STATE_UPLOADING ||
          s_flc.state == FLC_STATE_DOWNLOADING ||
          s_flc.state == FLC_STATE_ERROR)) {
        return;
    }

    uint32_t round_before = s_flc.round_count;

    App_UpdateLEDs(s_current_label, 1U);   /* Training LED on */
    FLC_Tick(&s_flc);
    App_UpdateLEDs(s_current_label, 0U);

    if (s_flc.round_count != round_before) {
        DataLogger_LogFLRound(s_flc.round_count, Utils_GetMillis(),
                               s_flc.last_round_loss, s_flc.total_samples,
                               s_flc.server_connected);
    }
}

/** UART single-byte command dispatch (labels, FL trigger, status, logging). */
static void Mod_UartCommand_Tick(void)
{
    if (!g_uart_rx_ready) {
        return;
    }
    g_uart_rx_ready = 0U;
    App_HandleUARTCommand(g_uart_rx_byte);
    /* Re-arm UART interrupt for next byte */
    HAL_UART_Receive_IT(&huart2, &g_uart_rx_byte, 1U);
}

static void App_Init(void)
{
    /* Start microsecond timer */
    Utils_TimerInit();

    /* Start 100 Hz TIM3 interrupt */
    HAL_TIM_Base_Start_IT(&htim3);

    /* Seed PRNG deterministically for reproducible Xavier initialization */
    Utils_SeedRNG(0xABCD1234UL);

    /* Initialize neural network weights */
    NN_Init(&s_nn);

    /* Initialize FL client */
    FLC_Init(&s_flc, &s_nn, &huart1);

    /* Initialize complementary filter */
    CF_Init(&s_cf_state);

    /* Initialize feature extractor */
    FE_Init(&s_fe);

    /* Initialize MPU-6050 */
    MPU6050_Status_t mpu_ret = MPU6050_Init(&s_mpu, &hi2c1);
    if (mpu_ret != MPU6050_OK) {
        LOG_ERR("MPU6050 init FAILED (code %u) — check I2C wiring", mpu_ret);
        /* Blink error LED and halt */
        while (1) {
            HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);   /* Red LED */
            HAL_Delay(100U);
        }
    }

    /* Skip blocking gyro calibration for now so the main loop can run */
    LOG_INF("MPU6050 calibration skipped (temporary)");

    /*
     * Build the AppModule table (see AppModule.h). Order matters — it is
     * the tick order — and mirrors the original hand-written sequence:
     * IMU sampling first, then the 1 Hz feature/FL step, then the FL FSM,
     * then SD log draining, then the lowest-priority UART command check.
     */
    AppModule_Register(&s_mod_imu);
    AppModule_Register(&s_mod_feature);
    AppModule_Register(&s_mod_flc);
    AppModule_Register(&g_datalogger_module);   /* mounts SD + opens session file */
    AppModule_Register(&s_mod_uart);

    AppModule_InitAll();   /* currently only DataLogger has an Init() */

    LOG_INF("App_Init complete. Waiting for IMU data...");
}

/* 
 * UART COMMAND HANDLER
 *
 * Commands (single ASCII byte via debug UART):
 *   '0' — set label = CLASS_NORMAL
 *   '1' — set label = CLASS_IMBALANCE
 *   '2' — set label = CLASS_LOOSENESS
 *   'u' — trigger immediate FL upload
 *   'r' — reset FL client
 *   's' — print status
 *   'w' — print NN weight statistics
 *   'l' — print SD data-logger statistics (rows written/dropped, errors)
 *   'f' — force an immediate SD flush (f_sync) of the open log file
 */

static void App_HandleUARTCommand(uint8_t cmd)
{
    switch (cmd) {
        case '0':
            s_current_label = CLASS_NORMAL;
            LOG_INF("Label set → NORMAL");
            break;
        case '1':
            s_current_label = CLASS_IMBALANCE;
            LOG_INF("Label set → IMBALANCE");
            break;
        case '2':
            s_current_label = CLASS_LOOSENESS;
            LOG_INF("Label set → LOOSENESS");
            break;
        case 'u':
            FLC_TriggerUpload(&s_flc);
            break;
        case 'r':
            FLC_Reset(&s_flc);
            break;
        case 's':
            FLC_PrintStatus(&s_flc);
            break;
        case 'w':
            NN_PrintWeightStats(&s_nn);
            break;
        case 'l': {
            DataLogger_Stats_t st;
            DataLogger_GetStats(&st);
            LOG_INF("SD LOG:  mounted=%u written=%lu dropped=%lu write_err=%lu",
                    st.log_mounted, st.log_rows_written, st.log_rows_dropped, st.log_write_errors);
            LOG_INF("SD DATA: mounted=%u written=%lu write_err=%lu",
                    st.data_mounted, st.data_rows_written, st.data_write_errors);
            LOG_INF("SD IMU:  mounted=%u written=%lu dropped=%lu write_err=%lu remounts=%lu",
                    st.imu_mounted, st.imu_rows_written, st.imu_rows_dropped, st.imu_write_errors,
                    st.remount_count);
            break;
        }
        case 'f':
            DataLogger_Flush();
            LOG_INF("SD Log: forced flush complete");
            break;
        default:
            LOG_VRB("Unknown cmd: 0x%02X", cmd);
            break;
    }
}

